# Playing With Matrix

In [11]:
import pandas as pd
import numpy as np

QUESTION 1

In [17]:
matrix1 = [(1, 1, 2),

           (0, 2, 1),

           (2, 0, 1)];

 

matrix2 = [(2, 0, 2),

           (1, 1, 1),

           (2, 2, 2)];

In [13]:
dataFrame1 = pd.DataFrame(matrix1);

dataFrame2 = pd.DataFrame(matrix2);

In [21]:
print("Matrix1:");

print(dataFrame1);

print("Dimension:");

print(dataFrame1.shape);

Matrix1:
   0  1  2
0  1  1  2
1  0  2  1
2  2  0  1
Dimension:
(3, 3)

In [16]:
print("Matrix2:");

print(dataFrame2);

print("Dimension:");

print(dataFrame2.shape);

Matrix2:
   0  1  2
0  2  0  2
1  1  1  1
2  2  2  2
Dimension:
(3, 3)

In [148]:
# Multiply the matrices: Matrix1 and Matrix2

result = dataFrame1.dot(dataFrame2);

In [149]:
result

   0  1  2
0  7  5  7
1  4  4  4
2  6  2  6

In [150]:
print("Dimension of the resultant matrix:");

print(result.shape);

Dimension of the resultant matrix:
(3, 3)

QUESTION 2

In [22]:
data1 = {
  "name": ["Sally", "Mary", "John"],
  "age": [50, 40, 30]
}

data2 = {
  "name": ["Sally", "Peter", "Micky"],
  "age": [77, 44, 22]
}

In [23]:
df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)

In [35]:
dfR = df1.merge(df2, how='left')
dfR

    name  age
0  Sally   50
1   Mary   40
2   John   30

In [37]:
dfL = df1.merge(df2, how='right')
dfL

    name  age
0  Sally   77
1  Peter   44
2  Micky   22

QUESTION 3

In [38]:
#uploading csv file

df = pd.read_csv('C:/Users/User/Downloads/data.csv')

In [39]:
df.head()

   Duration  Pulse  Maxpulse  Calories
0        60    110       130     409.1
1        60    117       145     479.0
2        60    103       135     340.0
3        45    109       175     282.4
4        45    117       148     406.0

In [162]:
df.reindex([1,3,4,0,2])

   Duration  Pulse  Maxpulse  Calories
1        60    117       145     479.0
3        45    109       175     282.4
4        45    117       148     406.0
0        60    110       130     409.1
2        60    103       135     340.0

In [163]:
twoc=df.loc[0:2,['Calories','Duration']]
twoc

   Calories  Duration
0     409.1        60
1     479.0        60
2     340.0        60

QUESTION 4

In [166]:
ndfc=df.rename(columns={'Duration':'Period','Pulse':'Dhadkan','Calories':'Khana'})
ndfc

   Period  Dhadkan  Maxpulse  Khana
0      60      110       130  409.1
1      60      117       145  479.0
2      60      103       135  340.0
3      45      109       175  282.4
4      45      117       148  406.0
5      60      102       127  300.0
6      60      110       136  374.0
7      45      104       134  253.3

In [167]:
ndfr=df.rename(index={0:'a',1:'b',2:'c',3:'d',4:'e', 5: 'f', 6 : 'g', 7 : 'h'})
ndfr

   Duration  Pulse  Maxpulse  Calories
a        60    110       130     409.1
b        60    117       145     479.0
c        60    103       135     340.0
d        45    109       175     282.4
e        45    117       148     406.0
f        60    102       127     300.0
g        60    110       136     374.0
h        45    104       134     253.3